GraduateExpermentalPrograms/Experiment/ERS/Random/calculateReimbursementAmount/20/TC3.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exp="http://exp.simple.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <exp:calculateReimbursementAmount>
         <exp:stafflevel>seniormanager</exp:stafflevel>
         <exp:actualmonthlymileage>11050</exp:actualmonthlymileage>
      </exp:calculateReimbursementAmount>
   </soapenv:Body>
</soapenv:Envelope>