CBWSTC/CBWSTC_WorkSpace/Projects/ExpenseReimbursementSystem2/XML/airfareReimbursement.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <exp:airfareReimbursement xmlns:exp="http://exp.simple.ws">
         <!--anonymous type - enumeration: [seniormanager,manager,supervisor]-->
         <exp:stafflevel>?</exp:stafflevel>
         <!--anonymous type-->
         <exp:monthlysalesamount>?</exp:monthlysalesamount>
         <!--anonymous type-->
         <exp:airfareamount>?</exp:airfareamount>
         <!--anonymous type-->
         <exp:otherexpensesamount>?</exp:otherexpensesamount>
      </exp:airfareReimbursement>
   </soapenv:Body>
</soapenv:Envelope>