CBWSTC/CBWSTC_WorkSpace/Projects/ExpenseReimbursementSystem2/XML/totalAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <exp:totalAmount xmlns:exp="http://exp.simple.ws">
         <!--anonymous type - enumeration: [seniormanager,manager,supervisor]-->
         <exp:tstafflevel>?</exp:tstafflevel>
         <!--anonymous type-->
         <exp:tactualmonthlymileage>?</exp:tactualmonthlymileage>
         <!--anonymous type-->
         <exp:tmonthlysalesamount>?</exp:tmonthlysalesamount>
         <!--anonymous type-->
         <exp:tairfareamount>?</exp:tairfareamount>
         <!--anonymous type-->
         <exp:totherexpensesamount>?</exp:totherexpensesamount>
      </exp:totalAmount>
   </soapenv:Body>
</soapenv:Envelope>