GraduateExpermentalPrograms/Experiment/ERS/Random/calculateReimbursementAmount/TestCase/TC6.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exp="http://exp.simple.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <exp:calculateReimbursementAmount>
         <exp:stafflevel>manager</exp:stafflevel>
         <exp:actualmonthlymileage>18816</exp:actualmonthlymileage>
      </exp:calculateReimbursementAmount>
   </soapenv:Body>
</soapenv:Envelope>